Tekla Open API Reference for Tekla Structures 2025
EnvironmentFiles Class
 The EnvironmentFiles class is for the paths where the attributes file will be searched for.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Dialog.UIControls.EnvironmentFiles
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class EnvironmentFiles
Public Class EnvironmentFiles
The EnvironmentFiles type exposes the following members.
Constructors
Name | Description
EnvironmentFiles
Initializes a new instance of the EnvironmentFiles class
Top
Properties
Name | Description
PropertyFileDirectories
 The directories where to look for property files.
Top
Methods
Name | Description
GetAttributeFile(String)
 Gets a file info representing the first match in the standard property file directories.
GetAttributeFile(List<String>, String) |  Obsolete.
 Gets a file info representing the first match in the search directories.
GetAttributeFiles
 Gets attribute files with specified suffix from model, XS_FIRM and XS_PROJECT directories and subdirectories.
GetMultiDirectoryFileList(String)
 Gets a list of files with the given extension from the default search directories.
GetMultiDirectoryFileList(List<String>, String)
 Gets a list of files with the given extension from the given search directories and from XS_FIRM, XS_PROJECT subdirectories.
GetStandardPropertyFileDirectories
 Gets the paths where to look for the property files.
IsValidDirectory
 Checks if a directory is valid.
Top
Examples
using System.Collections.Generic;
using Tekla.Structures.Catalogs;
using Tekla.Structures.Dialog.UIControls;
using Tekla.Structures.Model;
namespace EnvFilesExample
{
    internal class Program
    {
        static void Main()
        {
            List<string> folderList = EnvironmentFiles.GetStandardPropertyFileDirectories();
            List<string> reportList = EnvironmentFiles.GetMultiDirectoryFileList(folderList, "rpt");
            ComponentItem basePlateComponentItem = new ComponentItem();
            basePlateComponentItem.Select("Base Plate Detail", 1014);
            string basePlateAttribFileExtension = basePlateComponentItem.AttributeFileExtension;
            List<string> basePlateList = EnvironmentFiles.GetMultiDirectoryFileList(folderList, basePlateAttribFileExtension);
            ComponentItem meshBarsComponentItem = new ComponentItem();
            meshBarsComponentItem.Select("MeshBars", BaseComponent.PLUGIN_OBJECT_NUMBER);
            string meshBarsAttribFileExtension = meshBarsComponentItem.AttributeFileExtension;
            List<string> meshBarsList = EnvironmentFiles.GetMultiDirectoryFileList(folderList, meshBarsAttribFileExtension);
        }
    }
}
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace